OpenDTEF-v2012/tutorials/compressible/rhoPimpleFoam/RAS/externalCoupledSquareBendLiq/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inletWalls
    {
        type            mixed;
        refValue        uniform 250;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 250;
    }

    "(?i).*walls"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
